<!-- attach-outputs:plan-nodes-test.txt -->
  <!-- Output: plan-nodes-test.txt -->
  #### plan-nodes-test.txt 📖: `test: success, prod: success`

  **Last updated:** Mar 16, 2026, 12:28 PM UTC

  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster.module.talos-vm["tiles-test-cp"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7411"
      ~ ipv6_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "fe80::be24:11ff:fed0:7411",
            ],
          ~ [
              ~ "fe80::2cbf:c8ff:feae:1246" -> "fe80::4c81:6bff:fe5b:401",
            ],
          ~ [
              ~ "fe80::5ced:d4ff:fe1e:5beb" -> "fe80::b0ee:a8ff:fe65:38ae",
            ],
            [
                "fe80::200:ff:fe00:0",
            ],
            # (10 unchanged elements hidden)
        ]
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "7E:FF:47:2B:A8:34" -> "B6:5F:6D:B2:06:34",
          ~ "F2:A1:7A:34:BE:F5" -> "8A:89:7C:37:0F:92",
            "00:00:00:00:00:00",
            # (3 unchanged elements hidden)
            "BC:24:11:D0:74:11",
          ~ "2E:BF:C8:AE:12:46" -> "4E:81:6B:5B:04:01",
          ~ "5E:ED:D4:1E:5B:EB" -> "B2:EE:A8:65:38:AE",
            "00:00:00:00:00:00",
            # (10 unchanged elements hidden)
        ]
        name                                 = "tiles-test-cp"
      ~ network_interface_names              = [
            # (10 unchanged elements hidden)
            "lxc_health",
          ~ "lxc682df9aa126b" -> "lxc867de1901ae6",
          ~ "lxcbd87ec44c3db" -> "lxc686b02fb3949",
          ~ "lxc9395cc273e69" -> "lxcae79b8edfb62",
          ~ "lxc80a2cefec6e2" -> "lxc852a36fcbae1",
          ~ "lxc138149c68e39" -> "lxc96b434cdd204",
          ~ "lxc2f742ef3effd" -> "lxcffde8ef2323b",
          ~ "lxc438d77e71bb6" -> "lxc2d184c002cad",
          ~ "lxc6679358d0b3e" -> "lxca89048cee9a6",
          ~ "lxc055b9c9d9dc8" -> "lxc8bc84a68bcdc",
          ~ "lxcd3f180068a5c" -> "lxcf6dd893261cd",
        ]
        tags                                 = []
        # (32 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7421"
      ~ ipv6_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "fe80::be24:11ff:fed0:7421",
            ],
          ~ [
              ~ "fe80::98ec:c7ff:fec2:e581" -> "fe80::885c:c7ff:fe07:2dfc",
            ],
          ~ [
              ~ "fe80::63:4eff:fedf:2f78" -> "fe80::b4cf:73ff:fec3:6fc7",
            ],
            [
                "fe80::200:ff:fe00:0",
            ],
            # (40 unchanged elements hidden)
        ]
      ~ mac_addresses                        = [
            "00:00:00:00:00:00",
          ~ "4A:FB:0D:00:40:30" -> "AA:CB:E0:AA:2E:31",
          ~ "B2:DF:FB:7B:53:D2" -> "52:20:16:0D:86:2A",
            "00:00:00:00:00:00",
            # (3 unchanged elements hidden)
            "BC:24:11:D0:74:21",
          ~ "9A:EC:C7:C2:E5:81" -> "8A:5C:C7:07:2D:FC",
          ~ "02:63:4E:DF:2F:78" -> "B6:CF:73:C3:6F:C7",
            "00:00:00:00:00:00",
            # (40 unchanged elements hidden)
        ]
        name                                 = "tiles-test-wk"
      ~ network_interface_names              = [
            # (10 unchanged elements hidden)
            "lxc_health",
          ~ "lxccf4e789c3e3b" -> "lxcd7ee88b47fa3",
          ~ "lxcc6c3e5108dab" -> "lxc5ac519954814",
          ~ "lxc17e353b989e1" -> "lxc3d94555567a6",
          ~ "lxc667bf97f1f6b" -> "lxcfbd34d4b5dd4",
          ~ "lxcf5407cec5a99" -> "lxc9c324ba449fc",
          ~ "lxc066140091dbc" -> "lxc53f256d3ffe7",
          ~ "lxc958ae75f8bac" -> "lxca565e016e34a",
          ~ "lxcd227b6d8f121" -> "lxc4682d56fca8b",
          ~ "lxc81479f8513d5" -> "lxc1c9feeb18c21",
          ~ "lxc61ddd946daed" -> "lxc3b9103b1200d",
          ~ "lxcd29b137e6e1a" -> "lxc2a90d94f845b",
          ~ "lxc27092b1e4e43" -> "lxca9cc846cee07",
          ~ "lxc235ef6d7bd34" -> "lxc7c102f80ae30",
          ~ "lxc8e31df276233" -> "lxc8cce62703fed",
          ~ "lxc6141c7060be1" -> "lxc88a3608cf903",
          ~ "lxc55283c45e4c9" -> "lxcc7520402dbf4",
          ~ "lxc72a4e064a910" -> "lxc73e33d1e4314",
          ~ "lxcc17e9d5f1f83" -> "lxce2abeb7e8963",
          ~ "lxc6260c2f8cc54" -> "lxc70e8d3d421db",
          ~ "lxc6a5866621edc" -> "lxc249d485aac20",
          ~ "lxcd67b2d2c00d6" -> "lxc6fb0213c7132",
          ~ "lxc9d966cf0b0ae" -> "lxcc896f05e677a",
          ~ "lxc14b18c4c256e" -> "lxcb2c1c95461bf",
          ~ "lxc4d98bc7f8dd4" -> "lxc676416549a8f",
          ~ "lxc65dc3b82856c" -> "lxc73b4af71b886",
          ~ "lxcc3b0a08b95d4" -> "lxcc4fd734043c3",
          ~ "lxc253b22db43b3" -> "lxc4862530a4d8a",
          ~ "lxc34a321c88eb9" -> "lxcbb325c097b2d",
          ~ "lxcc784ed750529" -> "lxcfecadd7ae9be",
          ~ "lxc5f19fe97681a" -> "lxcd34ea94e9f85",
          ~ "lxc49f05cb5def1" -> "lxccc21c990a543",
          ~ "lxcb0c273297411" -> "lxccf39435522be",
          ~ "lxc2123ad797b1d" -> "lxca73961d04771",
          ~ "lxcfbd24d2dfe1b" -> "lxcb92c759c8b2f",
          ~ "lxcf687f9aa3f3c" -> "lxccae5c055c846",
          ~ "lxcd605885cb431" -> "lxcb2b21cb599e0",
          ~ "lxc836d0ab499ca" -> "lxca97e86c4015a",
          ~ "lxc8bf08be3e81b" -> "lxc2c8c6be3156b",
          ~ "lxc493727ec6a15" -> "lxc347d1beef156",
          ~ "lxc03816fd0870a" -> "lxc6d41487c6c6b",
        ]
        tags                                 = []
        # (32 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_virtual_environment_container.alloy["nuc-g2p-1"] will be created
  + resource "proxmox_virtual_environment_container" "alloy" {
      + description    = <<-EOT
            Alloy monitoring container for nuc-g2p-1 - collects host metrics and logs via node_exporter (hwmon sensors) and system logs
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "nuc-g2p-1"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "alloy",
          + "monitoring",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = false
      + vm_id          = 200

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 4
        }

      + initialization {
          + hostname = "alloy-nuc-g2p-1"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + mount_point {
          + acl               = false
          + backup            = false
          + path              = "/host"
          + path_in_datastore = (known after apply)
          + quota             = false
          + read_only         = true
          + replicate         = true
          + shared            = false
          + volume            = "/"
        }

      + network_interface {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "net0"
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + template_file_id = "local:vztmpl/alloy_latest.tar"
          + type             = "ubuntu"
        }
    }

  # proxmox_virtual_environment_container.alloy["nuc-g2p-2"] will be created
  + resource "proxmox_virtual_environment_container" "alloy" {
      + description    = <<-EOT
            Alloy monitoring container for nuc-g2p-2 - collects host metrics and logs via node_exporter (hwmon sensors) and system logs
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "nuc-g2p-2"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "alloy",
          + "monitoring",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = false
      + vm_id          = 200

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 4
        }

      + initialization {
          + hostname = "alloy-nuc-g2p-2"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + mount_point {
          + acl               = false
          + backup            = false
          + path              = "/host"
          + path_in_datastore = (known after apply)
          + quota             = false
          + read_only         = true
          + replicate         = true
          + shared            = false
          + volume            = "/"
        }

      + network_interface {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "net0"
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + template_file_id = "local:vztmpl/alloy_latest.tar"
          + type             = "ubuntu"
        }
    }

  # proxmox_virtual_environment_container.alloy["nuc-g3p-1"] will be created
  + resource "proxmox_virtual_environment_container" "alloy" {
      + description    = <<-EOT
            Alloy monitoring container for nuc-g3p-1 - collects host metrics and logs via node_exporter (hwmon sensors) and system logs
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "nuc-g3p-1"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "alloy",
          + "monitoring",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = false
      + vm_id          = 200

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 4
        }

      + initialization {
          + hostname = "alloy-nuc-g3p-1"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + mount_point {
          + acl               = false
          + backup            = false
          + path              = "/host"
          + path_in_datastore = (known after apply)
          + quota             = false
          + read_only         = true
          + replicate         = true
          + shared            = false
          + volume            = "/"
        }

      + network_interface {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "net0"
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + template_file_id = "local:vztmpl/alloy_latest.tar"
          + type             = "ubuntu"
        }
    }

  # proxmox_virtual_environment_container.alloy["nuc-g3p-2"] will be created
  + resource "proxmox_virtual_environment_container" "alloy" {
      + description    = <<-EOT
            Alloy monitoring container for nuc-g3p-2 - collects host metrics and logs via node_exporter (hwmon sensors) and system logs
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "nuc-g3p-2"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "alloy",
          + "monitoring",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = false
      + vm_id          = 200

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 4
        }

      + initialization {
          + hostname = "alloy-nuc-g3p-2"

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + mount_point {
          + acl               = false
          + backup            = false
          + path              = "/host"
          + path_in_datastore = (known after apply)
          + quota             = false
          + read_only         = true
          + replicate         = true
          + shared            = false
          + volume            = "/"
        }

      + network_interface {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "net0"
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + template_file_id = "local:vztmpl/alloy_latest.tar"
          + type             = "ubuntu"
        }
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g2p-1"] will be created
  + resource "proxmox_virtual_environment_file" "alloy_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "nuc-g2p-1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
                // Node exporter for host system metrics
                // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
                  procfs_path = "/host/proc"
                  sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g2p-1"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g2p-1",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g2p-1",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g2p-1",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g2p-1",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          + file_name = "alloy-proxmox-nuc-g2p-1.alloy"
          + resize    = 0
        }
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g2p-2"] will be created
  + resource "proxmox_virtual_environment_file" "alloy_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "nuc-g2p-2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
                // Node exporter for host system metrics
                // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
                  procfs_path = "/host/proc"
                  sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g2p-2"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g2p-2",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g2p-2",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g2p-2",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g2p-2",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          + file_name = "alloy-proxmox-nuc-g2p-2.alloy"
          + resize    = 0
        }
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g3p-1"] will be created
  + resource "proxmox_virtual_environment_file" "alloy_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "nuc-g3p-1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
                // Node exporter for host system metrics
                // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
                  procfs_path = "/host/proc"
                  sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g3p-1"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g3p-1",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g3p-1",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g3p-1",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g3p-1",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          + file_name = "alloy-proxmox-nuc-g3p-1.alloy"
          + resize    = 0
        }
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g3p-2"] will be created
  + resource "proxmox_virtual_environment_file" "alloy_config" {
      + content_type           = "snippets"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "nuc-g3p-2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
                // Node exporter for host system metrics
                // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
                  procfs_path = "/host/proc"
                  sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g3p-2"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g3p-2",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g3p-2",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g3p-2",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g3p-2",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          + file_name = "alloy-proxmox-nuc-g3p-2.alloy"
          + resize    = 0
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

  ```

  </details>
  
  